app/controllers/events_controller.rb

  def index
    @events = Event.upcoming.ordered
---
SELECT "events".* FROM "events"

  def create
    @event = Event.new(event_params)

    if @event.save
---
INSERT INTO "events" ("title", "created_at", "updated_at", "start_time", "end_time", "description") VALUES (?, ?, ?, ?, ?, ?)